app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "this post should have a user"], ["body", "asdasdasdasd"], ["created_at", "2019-01-21 21:41:56.405096"], ["updated_at", "2019-01-21 21:41:56.405096"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save